#!/usr/bin/env python3

#============================#
#        andromalius         #
#            ^_^             #
#============================#

banner = r"""
    
 $$$$$$\                $$\                                                 $$\$$\                   
$$  __$$\               $$ |                                                $$ \__|                  
$$ /  $$ $$$$$$$\  $$$$$$$ |$$$$$$\  $$$$$$\ $$\   $$\$$$$$$\$$$$\  $$$$$$\ $$ $$\$$\   $$\ $$$$$$$\ 
$$$$$$$$ $$  __$$\$$  __$$ $$  __$$\$$  __$$\$$ |  $$ $$  _$$  _$$\ \____$$\$$ $$ $$ |  $$ $$  _____|
$$  __$$ $$ |  $$ $$ /  $$ $$ |  \__$$ /  $$ $$ |  $$ $$ / $$ / $$ |$$$$$$$ $$ $$ $$ |  $$ \$$$$$$\  
$$ |  $$ $$ |  $$ $$ |  $$ $$ |     $$ |  $$ $$ |  $$ $$ | $$ | $$ $$  __$$ $$ $$ $$ |  $$ |\____$$\ 
$$ |  $$ $$ |  $$ \$$$$$$$ $$ |     \$$$$$$  \$$$$$$  $$ | $$ | $$ \$$$$$$$ $$ $$ \$$$$$$  $$$$$$$  |
\__|  \__\__|  \__|\_______\__|      \______/ \______/\__| \__| \__|\_______\__\__|\______/\_______/ 

                                                                                                 
"""

import subprocess
import os
from neotermcolor import colored

def display_banner():
    print(colored(banner, "white"))

def main():
    display_banner()
    print("___________________________________________")
    print("")
    print("1. Запустить первый скрипт (ProxyNova)")
    print("2. Запустить второй скрипт (Телефон)")
    print("3. Запустить третий скрипт (Почта)")
    print("4. Запустить четвертый скрип (Пароль)")
    print("5. Выход")

    choice = input("Выберите опцию (1/2/3/4/5): ").strip()

    if choice == "1":
        print("Запуск первого скрипта...")
        subprocess.run(["python", "proxynova.py"])
    elif choice == "2":
        print("Запуск второго скрипта...")
        subprocess.run(["python", "check_phone.py"])
    elif choice == "3":
        print("Запуск третьего скрипта...")
        subprocess.run(["python", "check_pochta.py"])
    elif choice == "4":
        print("Запуск четвертого скрипта...")
        subprocess.run(["python", "check_password.py"])
    elif choice == "5":
        print("Выход из программы.")
    else:
        print("Неверный выбор. Попробуйте снова.")
        main()

if __name__ == "__main__":
    main()
